[
  {
    "Id": 1,
    "id": "community_1",
    "name": "webdev",
    "description": "A community for web developers to share knowledge, discuss trends, and help each other grow. From frontend frameworks to backend architectures, all topics welcome.",
    "memberCount": 45320,
    "color": "#61DAFB"
  },
  {
    "Id": 2,
    "id": "community_2",
    "name": "fitness",
    "description": "Your go-to place for fitness motivation, workout routines, nutrition advice, and celebrating personal achievements. All fitness levels welcome!",
    "memberCount": 78940,
    "color": "#FF6B6B"
  },
  {
    "Id": 3,
    "id": "community_3",
    "name": "cooking",
    "description": "Share recipes, cooking tips, kitchen disasters, and culinary successes. From beginner basics to advanced techniques, let's cook together!",
    "memberCount": 123450,
    "color": "#4ECDC4"
  },
  {
    "Id": 4,
    "id": "community_4",
    "name": "jobs",
    "description": "Career advice, job hunting tips, interview experiences, and professional networking. Build your career with community support.",
    "memberCount": 67890,
    "color": "#45B7D1"
  },
  {
    "Id": 5,
    "id": "community_5",
    "name": "photography",
    "description": "A place for photographers to share their work, get feedback, discuss techniques, and appreciate the art of capturing moments.",
    "memberCount": 89340,
    "color": "#96CEB4"
  },
  {
    "Id": 6,
    "id": "community_6",
    "name": "productivity",
    "description": "Tips, tools, and strategies for getting things done efficiently. Share your productivity systems and learn from others.",
    "memberCount": 34560,
    "color": "#FFEAA7"
  },
  {
    "Id": 7,
    "id": "community_7",
    "name": "pets",
    "description": "Cute pet photos, funny stories, training advice, and everything about our beloved animal companions. All pets welcome!",
    "memberCount": 156780,
    "color": "#DDA0DD"
  },
  {
    "Id": 8,
    "id": "community_8",
    "name": "books",
    "description": "Book recommendations, reviews, reading challenges, and discussions about literature. Let's explore the world through books!",
    "memberCount": 98760,
    "color": "#F39C12"
  },
  {
    "Id": 9,
    "id": "community_9",
    "name": "environment",
    "description": "Discussions about climate change, sustainability, environmental policy, and practical eco-friendly living tips.",
    "memberCount": 43210,
    "color": "#27AE60"
  },
  {
    "Id": 10,
    "id": "community_10",
    "name": "community",
    "description": "Local news, events, and discussions about community issues. A place to connect with your neighbors and make a positive impact.",
    "memberCount": 23450,
    "color": "#E74C3C"
  }
]